app/views/borrowings/_form.html.erb

    <% if current_user.has_role? :admin %>
        <%= f.collection_select(:user_id, User.all, :id, :name) %>
    <% else %>
        <%= f.collection_select(:user_id, User.where(:id => current_user.id), :id, :name) %>
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]