app/views/borrowings/_form.html.erb

    <%= f.label :book_id %><br>
    <%= f.collection_select(:book_id, Book.all, :id, :title) %>
---
SELECT "books".* FROM "books"  ORDER BY title ASC