app/views/books/_form.html.erb

    <%= f.label :author_id %><br>
    <%= f.collection_select(:author_id, Author.all, :id, :name) %>
---
SELECT "authors".* FROM "authors"

    <%= f.label :office_id %><br>
    <%= f.collection_select(:office_id, Office.all, :id, :name) %>
---
SELECT "offices".* FROM "offices"