app/views/books/show.html.erb


  <% @book.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."book_id" = ?  [["book_id", 12]]