app/controllers/authors_controller.rb

  def index
    @authors = Author.all
---
SELECT "authors".* FROM "authors" WHERE (name LIKE '%as%')  ORDER BY created_at DESC

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sapkowski"], ["created_at", "2016-01-21 22:16:48.799799"], ["updated_at", "2016-01-21 22:16:48.799799"]]

  def destroy
    unless books_of_author.empty?
      respond_to do |format|
        format.html { redirect_to authors_url, notice: 'Author can\'t be destroyed due to his books.' }
        format.json { head :no_content }
      end
      return
    end
    unless borrowings_of_author.empty?
      respond_to do |format|
        format.html { redirect_to authors_url, notice: 'Author can\'t be destroyed due to his borrowings.' }
        format.json { head :no_content }
      end
      return
    end
    if @author.destroy
---
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 1]]