app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (title LIKE '%witcher%' OR description LIKE '%witcher%')  ORDER BY created_at DESC
---
  def index
    @books = Book.all

INSERT INTO "books" ("title", "description", "author_id", "office_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "witcher"], ["description", "super kniha"], ["author_id", 1], ["office_id", 1], ["created_at", "2016-01-21 22:34:34.940853"], ["updated_at", "2016-01-21 22:34:34.940853"]]
---
  def create
    @book = Book.new(book_params)
    respond_to do |format|
      if @book.save

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    if borrowed?
      respond_to do |format|
        format.html { redirect_to books_url, notice: 'Book can\'t be destroyed, it is borrowed.' }
        format.json { head :no_content }
      end
      return
    end
    @book.destroy