app/controllers/borrowings_controller.rb

  def index
    if current_user.has_role? :admin
      if params[:search]
        @borrowings = Borrowing.search(params[:search])
      else
        @borrowings = Borrowing.all.order('due_date ASC')
      end
    else
      @borrowings = Borrowing.where(:user_id => current_user.id)
---
SELECT "borrowings".* FROM "borrowings" WHERE (user.name LIKE '%lion%' OR book.title LIKE '%lion%')  ORDER BY created_at DESC
SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."user_id" = ?  ORDER BY due_date ASC  [["user_id", 3]]

  def create
    @borrowing = Borrowing.new(borrowing_params)

    unless book_free?
      respond_to do |format|
        format.html { redirect_to @borrowing, notice: 'Borrowing was unsuccessfull. Book is already borrowed.' }
        format.json { render :show, status: :created, location: @borrowing }
      end
      return
    end

    respond_to do |format|
      if @borrowing.save
---
INSERT INTO "borrowings" ("user_id", "book_id", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["book_id", 2], ["due_date", "2016-01-20"], ["created_at", "2016-01-21 22:39:21.470654"], ["updated_at", "2016-01-21 22:39:21.470654"]]

  def destroy
    @borrowing.destroy
---
DELETE FROM "borrowings" WHERE "borrowings"."id" = ?  [["id", 1]]

    def set_borrowing
      @borrowing = Borrowing.find(params[:id])
---
SELECT  "borrowings".* FROM "borrowings" WHERE "borrowings"."id" = ? LIMIT 1  [["id", 1]]