app/controllers/offices_controller.rb

  def index
    @offices = Office.all
---
SELECT "offices".* FROM "offices"

  def create
    @office = Office.new(office_params)

    respond_to do |format|
      if @office.save
---
INSERT INTO "offices" ("name", "address", "contact", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "office1"], ["address", "brno"], ["contact", "09090090"], ["created_at", "2016-01-21 22:17:03.404009"], ["updated_at", "2016-01-21 22:17:03.404009"]]

    def set_office
      @office = Office.find(params[:id])
---
SELECT  "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT 1  [["id", 1]]