app/controllers/posts_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 12]]
INSERT INTO "posts" ("title", "body", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Nazov niecoho"], ["body", "telo blabla"], ["book_id", 42], ["user_id", 1], ["created_at", "2016-01-28 20:29:45.391757"], ["updated_at", "2016-01-28 20:29:45.391757"]]
UPDATE "posts" SET "user_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["user_id", 1], ["updated_at", "2016-01-25 18:38:58.103819"], ["id", 3]]
---
  def create
    @book = Book.find(params[:book_id])
    # @post = Post.new(post_params)
    @post = @book.posts.create(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 41]]
SELECT  "posts".* FROM "posts" WHERE "posts"."book_id" = ? AND "posts"."id" = ? LIMIT 1  [["book_id", 41], ["id", 8]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]
---
  def destroy
    @book = Book.find(params[:book_id])
    @post = @book.posts.find(params[:id])

    @post.destroy