app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jozko"], ["created_at", "2016-01-19 20:02:22.915237"], ["updated_at", "2016-01-19 20:02:22.915237"]]